password.org
#+TITLE:     少しはマシなパスワードの作り方
#+AUTHOR:    Takeshi Nagae
#+EMAIL:     nagae@m.tohoku.ac.jp
#+LANGUAGE:  ja
#+OPTIONS:   H:3 num:3 toc:2 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t author:t creator:t
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+OPTIONS: toc:1 num:3

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:imagemagick
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD:<link rel=stylesheet href="style.css" type="text/css">
#+HTML_LINK_UP: https://nagae.github.io/itl
#+HTML_LINK_HOME: https://nagae.github.io
#+INFOJS_OPT: view:showall toc:t sdepth:2 ltoc:1 mouse:nil buttons:nil
#+LATEX_HEADER:\usepackage{amsmath,rmss_math,rmss_color}

* 全てのサイトで同じパスワードを使ってはいけない
Google, iCloud, Dropbox, 楽天, メールサービス…全てのサイトで同じパスワードを使ってはいけない．
万が一どれか1つでも盗まれたら，登録している全てのサービスで自由にログインされてしまうから．
しかし，サイトごとに違うパスワードを覚えておくのは大変．だからといって紙にメモしては本末転倒．
そこで，以下のような方法でサイトごとに別々のパスワードを作ることをオススメする．
* 基本形：基本パスコード + サービス別コード
ここでは，サイト別のパスワードを, *基本コード* と *サービス個別コード* で構築する方法を紹介する．
まず，基本パスコードを，例えば， =P@ssw()rd= とする( *使っちゃダメよ* )．
次に，利用するサービスごとの個別コードを，例えば，
#+ATTR_HTML: ID="align_left" rules="all"
| サイト名               | 個別コード |
|------------------------+------------|
| Google                 | =Ggle=     |
| Dropbox                | =Dbox=     |
| 東北大学メールサーバー | =Thml=     |
などとする．そして，各サービスで実際に使うパスワードを
#+begin_quote
基本パスコード + つなぎ記号 + 個別コード
#+end_quote
とする．例えば，つなぎ記号として =%= を使う場合，
Google には =P@ssw()rd%Ggle=, Dropbox には =P@ssw()rd%Dbox=, 東北大学メールサーバーには =P@ssw()rd%Thml= というパスワードを設定する．
* 利点
 - サービスごとに全く違うパスワードを覚える必要がない．
 - どれか1つのサイトでパスワードが盗まれても，直ちに別のサービスまで危険になるわけではない．
 - 基本パスコード，記号およびその組み合わせ方さえ秘密にしておけば，個別コードがリークしても直ちに危険にはならない(むしろ，自分が利用しているサイトをメモしておけば，サイト別パスワードを整合的に更新できる)
* 注意点
- 基本パスコードは *6文字以上* で，英語の大文字・英語の小文字・数字が，それぞれ， *少くとも1つ* は入っていることが望ましい．
- 辞書に載っている単語，人名，地名，およびそれらを「o→0, ()」「i→1 」「a→@」などと変えたものを そのまま使わない．上記の =P@ssw()rd= は *使ってはいけない好例*
- サイト別パスコードをあまり長くしない．
- パスワード生成用のWebサイトなどは使わない(一見ランダムに見えるだけで，実は法則性があるかもしれない)．
- どうしても思いつかなければ =pwgen= を使ってみる．
* アレンジを効かせる
例えば，
- 個別コードを先に書くことにする(eg. =Ggle%P@ssw()rd=, =Dbox%P@ssw()rd=)
- 個別コードで基本コードを挟む(eg. =Gg%P@ssw()rd%le=, =Db%P@ssw()rd%ox=)
- 記号を変えたり，増やしてみる(eg. =P@ssw()rd@Ggle!=, =P@ssw()rd@Dbox!=)
とすると，さらに堅牢になる．
* 覚え易くてセキュアなパスコードの生成
基本パスコードは覚え易くてセキュアであることが望ましい．そんなコードを生成するGPL =pwgen= という UNIX コマンドを使ってみてはどうでしょう．
http://sourceforge.net/projects/pwgen/
#+begin_src screen
$ brew install pwgen # homebrew でインストール
$ pwgen --help # ヘルプを見る
$ pwgen -B -v 8 # 少なくとも1つが記号で，見間違い易い文字を使わない8文字のパスコードを生成
#+end_src
* 参考になるサイト
- https://www.grc.com/haystack.htm :: あなたのパスワードが総当たり攻撃によって「何秒」で破られるかを示してくれる．総当たり攻撃に対してはパスワードの複雑さよりも長さが重要だとする主張も．
- https://www.grc.com/OffTheGrid.htm :: 紙ベースでサイトごとの堅牢なパスワードを生成する方法．
