password.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>少しはマシなパスワードの作り方</title>
<!-- 2015-04-07 Tue 15:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Takeshi Nagae" />
<link rel=stylesheet href="style.css" type="text/css">


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://nagae.github.io/itl"> UP </a>
 |
 <a accesskey="H" href="https://nagae.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">少しはマシなパスワードの作り方</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 全てのサイトで同じパスワードを使ってはいけない</a></li>
<li><a href="#sec-2">2. 基本形：基本パスコード + サービス別コード</a></li>
<li><a href="#sec-3">3. 利点</a></li>
<li><a href="#sec-4">4. 注意点</a></li>
<li><a href="#sec-5">5. アレンジを効かせる</a></li>
<li><a href="#sec-6">6. 覚え易くてセキュアなパスコードの生成</a></li>
<li><a href="#sec-7">7. 参考になるサイト</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 全てのサイトで同じパスワードを使ってはいけない</h2>
<div class="outline-text-2" id="text-1">
<p>
Google, iCloud, Dropbox, 楽天, メールサービス…全てのサイトで同じパスワードを使ってはいけない．
万が一どれか1つでも盗まれたら，登録している全てのサービスで自由にログインされてしまうから．
しかし，サイトごとに違うパスワードを覚えておくのは大変．だからといって紙にメモしては本末転倒．
そこで，以下のような方法でサイトごとに別々のパスワードを作ることをオススメする．
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 基本形：基本パスコード + サービス別コード</h2>
<div class="outline-text-2" id="text-2">
<p>
ここでは，サイト別のパスワードを, <b>基本コード</b> と <b>サービス個別コード</b> で構築する方法を紹介する．
まず，基本パスコードを，例えば， <code>P@ssw()rd</code> とする( <b>使っちゃダメよ</b> )．
次に，利用するサービスごとの個別コードを，例えば，
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">サイト名</th>
<th scope="col" class="left">個別コード</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Google</td>
<td class="left"><code>Ggle</code></td>
</tr>

<tr>
<td class="left">Dropbox</td>
<td class="left"><code>Dbox</code></td>
</tr>

<tr>
<td class="left">東北大学メールサーバー</td>
<td class="left"><code>Thml</code></td>
</tr>
</tbody>
</table>
<p>
などとする．そして，各サービスで実際に使うパスワードを
</p>
<blockquote>
<p>
基本パスコード + つなぎ記号 + 個別コード
</p>
</blockquote>
<p>
とする．例えば，つなぎ記号として <code>%</code> を使う場合，
Google には <code>P@ssw()rd%Ggle</code>, Dropbox には <code>P@ssw()rd%Dbox</code>, 東北大学メールサーバーには <code>P@ssw()rd%Thml</code> というパスワードを設定する．
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 利点</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>サービスごとに全く違うパスワードを覚える必要がない．
</li>
<li>どれか1つのサイトでパスワードが盗まれても，直ちに別のサービスまで危険になるわけではない．
</li>
<li>基本パスコード，記号およびその組み合わせ方さえ秘密にしておけば，個別コードがリークしても直ちに危険にはならない(むしろ，自分が利用しているサイトをメモしておけば，サイト別パスワードを整合的に更新できる)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 注意点</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>基本パスコードは <b>6文字以上</b> で，英語の大文字・英語の小文字・数字が，それぞれ， <b>少くとも1つ</b> は入っていることが望ましい．
</li>
<li>辞書に載っている単語，人名，地名，およびそれらを「o→0, ()」「i→1 」「a→@」などと変えたものを そのまま使わない．上記の <code>P@ssw()rd</code> は <b>使ってはいけない好例</b>
</li>
<li>サイト別パスコードをあまり長くしない．
</li>
<li>パスワード生成用のWebサイトなどは使わない(一見ランダムに見えるだけで，実は法則性があるかもしれない)．
</li>
<li>どうしても思いつかなければ <code>pwgen</code> を使ってみる．
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> アレンジを効かせる</h2>
<div class="outline-text-2" id="text-5">
<p>
例えば，
</p>
<ul class="org-ul">
<li>個別コードを先に書くことにする(eg. <code>Ggle%P@ssw()rd</code>, <code>Dbox%P@ssw()rd</code>)
</li>
<li>個別コードで基本コードを挟む(eg. <code>Gg%P@ssw()rd%le</code>, <code>Db%P@ssw()rd%ox</code>)
</li>
<li>記号を変えたり，増やしてみる(eg. <code>P@ssw()rd@Ggle!</code>, <code>P@ssw()rd@Dbox!</code>)
</li>
</ul>
<p>
とすると，さらに堅牢になる．
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 覚え易くてセキュアなパスコードの生成</h2>
<div class="outline-text-2" id="text-6">
<p>
基本パスコードは覚え易くてセキュアであることが望ましい．そんなコードを生成するGPL <code>pwgen</code> という UNIX コマンドを使ってみてはどうでしょう．
<a href="http://sourceforge.net/projects/pwgen/">http://sourceforge.net/projects/pwgen/</a>
</p>
<div class="org-src-container">

<pre class="src src-screen">$ brew install pwgen <span style="color: #00cd66;"># </span><span style="color: #00cd66;">homebrew &#12391;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;</span>
$ pwgen --help <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#12504;&#12523;&#12503;&#12434;&#35211;&#12427;</span>
$ pwgen -B -v 8 <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#23569;&#12394;&#12367;&#12392;&#12418;1&#12388;&#12364;&#35352;&#21495;&#12391;&#65292;&#35211;&#38291;&#36949;&#12356;&#26131;&#12356;&#25991;&#23383;&#12434;&#20351;&#12431;&#12394;&#12356;8&#25991;&#23383;&#12398;&#12497;&#12473;&#12467;&#12540;&#12489;&#12434;&#29983;&#25104;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 参考になるサイト</h2>
<div class="outline-text-2" id="text-7">
<dl class="org-dl">
<dt> <a href="https://www.grc.com/haystack.htm">https://www.grc.com/haystack.htm</a> </dt><dd>あなたのパスワードが総当たり攻撃によって「何秒」で破られるかを示してくれる．総当たり攻撃に対してはパスワードの複雑さよりも長さが重要だとする主張も．
</dd>
<dt> <a href="https://www.grc.com/OffTheGrid.htm">https://www.grc.com/OffTheGrid.htm</a> </dt><dd>紙ベースでサイトごとの堅牢なパスワードを生成する方法．
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Takeshi Nagae</p>
<p class="date">Created: 2015-04-07 Tue 15:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
